In [1]:
import pandas as pd
import numpy as np

In [4]:
sözlük = {"A":[10, np.nan, np.nan, 40], "B":[15, np.nan, 20, 15],
         "C":[10,65,12,98], "D":[np.nan,20,np.nan,85]}
sözlük

{'A': [10, nan, nan, 40],
 'B': [15, nan, 20, 15],
 'C': [10, 65, 12, 98],
 'D': [nan, 20, nan, 85]}

In [7]:
tablo = pd.DataFrame(sözlük, index=["X","Y","Z","T"])
tablo

      A     B   C     D
X  10.0  15.0  10   NaN
Y   NaN   NaN  65  20.0
Z   NaN  20.0  12   NaN
T  40.0  15.0  98  85.0

In [8]:
tablo.dropna() # nan verileri çıkarır.

      A     B   C     D
T  40.0  15.0  98  85.0

In [12]:
tablo.dropna(axis=1) # axis=1 daima kolonların cevabını döndürür.

    C
X  10
Y  65
Z  12
T  98

In [15]:
tablo.fillna(100) # fillna() metoduna girilen parametre NaN olan bütün verileri atanır.

       A      B   C      D
X   10.0   15.0  10  100.0
Y  100.0  100.0  65   20.0
Z  100.0   20.0  12  100.0
T   40.0   15.0  98   85.0

In [16]:
tablo.fillna("Yasin")

       A      B   C      D
X   10.0   15.0  10  Yasin
Y  Yasin  Yasin  65   20.0
Z  Yasin   20.0  12  Yasin
T   40.0   15.0  98   85.0